Tekla.Structures.Model.BooleanPart
The BooleanPart class represents a part cut or an add. This means that a model object is, for example,
cut with a part instance to create a void to the father part. Typically the operative part is deleted after
the operation.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
public class Example
{
public void Example1()
{
Point point = new Point(0, 7000, 0);
Point point2 = new Point(1000, 7000, 0);
Beam Beam1 = new Beam();
Beam1.StartPoint = point;
Beam1.Profile.ProfileString = "400*400";
Beam1.EndPoint = point2;
Beam1.Insert();
Beam Beam2 = new Beam();
Beam2.Profile.ProfileString = "400*400";
Beam2.StartPoint = new Point(500, 6000, 0);
Beam2.EndPoint = new Point(500, 8000, 0);
Beam2.Class = BooleanPart.BooleanOperativeClassName;
Beam2.Insert();
BooleanPart Beam = new BooleanPart();
Beam.Father = Beam1;
Beam.SetOperativePart(Beam2);
if(!Beam.Insert())
Console.WriteLine("Insert failed!");
Beam2.Delete();
}
}